-----------------------------------------------------------------------------------------
--社區資訊APP
--
--讀取結束後進入登入頁面(1)
--登入頁面分成 使用訪客體驗(2)、社區用戶登入(3)、FB登入(4)

--訪客體驗直接跳轉至體驗介面

--用戶登入跳轉至輸入帳號密碼登入頁面(5) 
--登入頁面包含 登入、註冊(6)、以及忘記密碼(7)
--忘記密碼直接由下往上滑動出現
--註冊頁面包含三個步驟分別輸入不同資料

--體驗介面與主介面功能欄位皆相同，唯獨資訊為虛擬資料

--主介面(8)包含廣告幻燈片、社區公告(9)、住戶專區(10)、官方網站(11)
-- 、哥布林程式教育學院(12)、製作團隊(13)、官方跑馬燈公告

--住戶專區包含郵件包裹(14)、登出


--Date:2016/10/31   19:35
-----------------------------------------------------------------------------------------

--=======================================================================================
--引入各種函式庫
--=======================================================================================
composer = require("composer")
math.randomseed( os.time(  ) )
widget = require("widget")
--=======================================================================================
--宣告各種變數
--=======================================================================================
_SCREEN = {
	W = display.contentWidth ,
	H = display.contentHeight ,
	WIDTH = display.contentWidth,
	HEIGHT = display.contentHeight     --因為部分場景先加入這兩行，到時候再做修改
}
_SCREEN.CENTER = {
	X = display.contentCenterX ,
	Y = display.contentCenterY
}

WIDTH_RATIO = _SCREEN.W/750
HEIGHT_RATIO = _SCREEN.H/1334

FONTSIZE = 60
WEBVIEW_H = 1100 
BACK_FONTSIZE = 40

--預先載入音效


--=======================================================================================
--宣告各個函式名稱
--=======================================================================================
local init
local loading
local demo_scene = "loginType"

--=======================================================================================
--宣告與定義main()函式
--=======================================================================================
local main = function ( )
	init()
end

--=======================================================================================
--定義其他函式
--=======================================================================================
init = function (  )
	loading = display.newImageRect(  "images/loading.jpg", _SCREEN.W, _SCREEN.H )
	loading.x , loading.y = _SCREEN.CENTER.X , _SCREEN.CENTER.Y
	timer.performWithDelay( 15 , function (  )
		composer.gotoScene( demo_scene )
		loading:removeSelf( )
	end )
end

--=======================================================================================
--呼叫主函式
--=======================================================================================
main()



